Revit 2026 API

# DividedPathCreate(Document, IListReference, ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static DividedPath Create(
	Document document,
	IList<Reference> curveReferences,
	ICollection<ElementId> intersectors
)
```
```vb
Public Shared Function Create (
	document As Document,
	curveReferences As IList(Of Reference),
	intersectors As ICollection(Of ElementId)
) As DividedPath
```
```cpp
public:
static DividedPath^ Create(
	Document^ document,
	IList<Reference^>^ curveReferences,
	ICollection<ElementId^>^ intersectors
)
```
```fsharp
static member Create :
        document : Document *
        curveReferences : IList<Reference> *
        intersectors : ICollection<ElementId> -> DividedPath
```

#### Parameters

document Document

curveReferences IListReference

intersectors ICollectionElementId

#### Return Value

DividedPath

#### Reference

DividedPath Class

Create Overload

Autodesk.Revit.DB Namespace